Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/irish_citizenship/who_can_become_an_irish_citizen.html.txt.tmx
Source language: en
Languages: ga

source: Who can become an Irish citizen?
ga: Cé hiad na daoine ar féidir leo a bheith ina saoránaigh Éireannacha?

source: My parents were both born in Great Britain and so was I
ga: • Cé hiad na daoine ar féidir leo a bheith ina saoránaigh Éireannacha?

source: Am I entitled to Irish citizenship based on my Irish grandparents?
ga: Cé hiad na daoine ar féidir leo a bheith ina saoránaigh Éireannacha?

source: Yes, you are entitled to Irish citizenship by descent if any of your grandparents was born in Ireland, but you must first register your birth in the Foreign Births Register
ga: Sea, tá tú i dteideal do shaoránacht Éireannach trí oidhreacht má rugadh duine ar bith de do sheantuismitheoirí in Éirinn, ach caithfidh tú do bhreith a chlárú i gClár na mBreitheanna Coigríche i dtús báire

source: I am a US citizen but my mother was born in Galway
ga: Is saoránach SAM mé, ach rugadh mo mháthair i nGaillimh

source: I know that I can apply for an Irish passport, but do I have to renounce US citizenship to become an Irish citizen?
ga: Is eol dom gur féidir liom iarratas a dhéanamh ar phas Éireannach, ach an gcaithfidh mé saoránacht SAM a thréigean le bheith i mo shaoránach Éireannach?

source: Since your mother was born in Ireland, you are already an Irish citizen by descent, whether you have an Irish passport or not
ga: Ós rud é gur rugadh do mháthair in Éirinn, tá tú i do shaoránach Éireannach trí oidhreacht cheana féin, cibé an bhfuil pas Éireannach agat nó nach bhfuil

source: The Irish Government does not require you to renounce your US citizenship when exercising your right to apply for an Irish passport
ga: Ni chuireann Rialtas na hÉireann iallach ort do shaoránacht SAM a thréigean, nuair atá do cheart á chleachtadh agat, chun iarratas a dhéanamh ar phas Éireannach

source: My girlfriend and I are both Chinese citizens
ga: Is saoránaigh Briotanach mé agus rugadh mo bheirt thuismitheoirí in Éirinn

source: We have been working in Ireland since early 2012 on work permits, and we had a baby boy late in 2015. Is the baby entitled to Irish citizenship?
ga: Má dhéanaim iarratas ar phas Éireannach, an gcaithfidh mé mo shaoránacht Briotanach a thabhairt suas?

source: As you have been legally resident in Ireland for 3 of the 4 years prior to the birth of your child, you will be considered to have had a genuine link to Ireland, and the baby will be entitled to Irish citizenship
ga: Tá saoránaigh Briotanacha i dteideal saoránacht dhúbailte a bheith acu freisin. Ciallaíonn sé nach gcaithfidh tú do shaoránacht Briotanach a thabhairt suas chun iarratas ar phas Éireannach a dhéanamh

source: I am a British citizen whose parents were born in Ireland
ga: Táimid ag obair in Éirinn ó luath in 2012 ar cheadanna oibre, agus bhí leanbh againn déanach in 2015

source: If I apply for an Irish passport, will I have to give up my British citizenship?
ga: An bhfuil an leanbh i dteideal do shaoránacht Éireannach?

source: British citizens are also allowed to hold dual citizenship. This means that you do not have to renounce your British citizenship when you apply for an Irish passport
ga: Toisc go raibh tú cónaitheach go dleathach in Éirinn ar feadh trí nó ceithre bliana roimh bhreith an linbh, breithneofar go bhfuil nasc fírinneach agat le hÉirinn, agus beidh an leanbh i dteideal do shaoránacht Éireannach

source: I am Indian, and have been living and working in Wexford on a series of work permits for the last 4 years
ga: Is Indiach mé, agus táim ag cónaí agus ag obair i Loch Garman ar shraith de cheadúnais oibre le 4 bliana anuas

source: When I will be eligible to apply for naturalisation?
ga: Cén uair a bheidh mé i dteideal iarratas a dhéanamh ar eadóirseacht?

source: When you have lived in the State for a total of 5 out of the last 9 years, including the last full year before the date of application, you will be eligible to apply for naturalisation
ga: Nuair atá cónaí ort sa Stát ar feadh 5 bliana den 9 mbliana deiridh, ina áirítear an bhliain dheiridh iomlán roimh dháta an iarratais, beidh tú incháilithe d'iarratas a dhéanamh ar eadóirseacht

source: Can I become an Irish citizen through naturalisation after 2 years here as a language school student?
ga: An féidir liom a bheith i mo Shaoránach Éireannach trí eadóirseacht tar éis 2 bhliain a chaitheamh anseo mar mhac léinn i scoil teanga?

source: You need to have at least 5 years “reckonable residence” in the State to be considered for naturalisation, or at least 3 years if you are married to an Irish citizen
ga: Caithfidh tú ar a laghad 5 bliana de “cónaí ináirithe” a bheith agat sa Stát sula ndéanfar tú a bhreithniú d'eadóirseacht, nó ar a laghad 3 bliana má tá tú pósta le saoránach Éireannach

source: Also, time spent here on a student visa does not count at all for “reckonable residence”, so your “reckonable residence” is zero
ga: Ina theannta sin, ní thiteann am a chaitear anseo ar víosa mic léinn faoi “cónaí ináirithe”, agus mar sin tá an “cónaí ináirithe” agat cothrom le neamhní

source: I'm an Australian citizen and have been legally resident in Ireland since 2010
ga: Is saoránach na hAstráile mé agus táim cónaitheach go dleathach in Éirinn ó 2010

source: In 2012 I married an Irish citizen
ga: Phós mé saoránach Éireannach i 2012

source: Can I now apply for Irish citizenship?
ga: An féidir liom iarratas a dhéanamh ar shaoránacht Éireannach anois?

source: As you have been married to an Irish citizen for over 3 years, and have enough “reckonable residence” in the island of Ireland, you can apply to become an Irish citizen through marriage
ga: Toisc go bhfuil tú pósta le saoránach Éireannach os cionn 3 bliana, agus tá “cónaí ináirithe” dóthanach agat ar oileán na hÉireann, is féidir leat iarratas a dhéanamh a bheith i do shaoránach Éireannach trí phósadh

source: I am an Irish citizen, living in Wales with my South African partner
ga: Is saoránach Éireannach mé, atá ag cónaí sa Bhreatain Bheag le mo pháirtí ón Afraic Theas

source: We are getting married and intend to continue living in Wales
ga: Táimid ag pósadh agus tá sé beartaithe againn leanúint ag cónaí sa Bhreatain Bheag

source: Does my new husband automatically become an Irish citizen?
ga: An mbeidh an fear céile agam ina shaoránach Éireannach go huathoibríoch?

source: You would have to be married for at least 3 years, and you would have to be living as a married couple in the island of Ireland for at least 3 years also
ga: Bheadh ort a bheith pósta ar feadh 3 bliana ar a laghad, agus bheadh oraibh a bheith ag cónaí mar lánúin phósta ar oileán na hÉireann ar feadh 3 bliana ar a laghad chomh maith

source: I am a British citizen with a British passport
ga: Is saoránach Briotanach mé le pas Briotanach

source: I am originally from Nepal and have been living in Northern Ireland for 4 years
ga: Is ón Neipeal mé ó dhúchas agus táim ag cónaí i dTuaisceart Éireann le 4 bliana anuas

source: Can I become an Irish citizen?
ga: An féidir liom a bheith i mo shaoránach Éireannach?

source: No, unless you are applying as the spouse of an Irish citizen to whom you have been married for 3 years
ga: Ní bheadh a leithéid indéanta, ach amháin dá mbeifeá ag déanamh iarratais mar chéile de shaoránach Éireannach lena bhfuil tú pósta le trí bliana anuas

source: To become an Irish citizen through naturalisation you would have to be living in the Irish State for at least 5 out of the last 9 years
ga: Le bheith i do shaoránach Éireannach trí eadóirseacht, caithfidh tú a bheith ag cónaí sa Stát na hÉireann ar feadh 5 bliana ar a laghad den 9 mbliana deiridh

source: I am French, married to an Irishman and living in Ireland for 8 years
ga: Is Francach mé, atá pósta le fear Éireannach agus ag cónaí in Éirinn le 8 mbliana anuas

source: If I become an Irish citizen, can also keep my French citizenship?
ga: Má dhéantar saoránach Éireannach díom, an féidir liom mo shaoránacht Francach a choinneáil chomh maith?

source: The Irish Government does not require you to renounce your French citizenship on becoming an Irish citizen
ga: Ní chuireann Rialtas na hÉireann iallach ort do shaoránacht Francach a thréigean nuair a dhéantar saoránach Éireannach díot

source: Can a Russian woman, with an Irish citizen child, (now living in Russia) receive Irish citizenship?
ga: An féidir le bean Rúiseach, le leanbh atá ina shaoránach Éireanach, (anois ag cónaí sa Rúis) saoránacht na hÉireann a fháil?

source: There is no entitlement for her to work permits, and we had a baby boy late in 2015. Is the baby entitled to Irish citizenship?
ga: Níl aon teidlíocht aici a bheith ina saoránach Éireannach ar bhonn saoránachta an linbh
